[Cues]
Cue_E2_6A_CampusA_Insertion_RTC_Max_010="I just... can't believe it. It's like it wasn't even real... Watching her drop like a weight...I really thought I could save her... like a superhero."
Cue_E2_6A_CampusA_Insertion_RTC_Max_030="My hand just reached out—"
Cue_E2_6A_CampusA_Insertion_RTC_Max_050="Yeah, I sure made a big fucking difference. Maybe if more people cared...better people than me..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_070="Warren, I screwed up today."
Cue_E2_6A_CampusA_Insertion_RTC_Max_090="I couldn't even believe it was happening. It was literally slow motion as I grabbed her hand... and then I could feel her grabbing mine..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_110="Not quite. Look at me, I'm a mess."
Cue_E2_6A_CampusA_Insertion_RTC_Max_130="I'm still worried about Kate. She did try to kill herself. All over a video..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_150="So you watched it?"
Cue_E2_6A_CampusA_Insertion_RTC_Max_170="Warren, I don't mean to sound weird, but there's something ominous going on at Blackwell..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_190="And I'm working on proof that Kate Marsh is connected to Rachel Amber... somehow. Along with Nathan and Mr. Madsen."
Cue_E2_6A_CampusA_Insertion_RTC_Max_210="What the hell is this..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_230="Brrr... I do feel cold."
Cue_E2_6A_CampusA_Insertion_RTC_Max_250="That's sweet, thanks. I'm okay."
Cue_E2_6A_CampusA_Insertion_RTC_Max_260="The weather confirms this weird day. Feel that chill..."
Cue_E2_6A_CampusA_Insertion_RTC_Max_270="Talk about "chiaroscuro.""
Cue_E2_6A_CampusA_Insertion_RTC_Max_290="I believe you, Warren... I'll believe anything this week..."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_020="Come on, Max. Do not for a second blame yourself. Kate was on that roof for her reasons, not yours."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_040="Stop it. You were the only one with balls enough to run to the roof. You were the only one who cared."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_060="You're the best person around—"
Cue_E2_6A_CampusA_Insertion_RTC_Warren_080="That makes no logical sense."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_100="Max, that was the greatest thing I've ever seen. Ever. You reached out, she reached out... Hugs, tears, applause... Like a superhero!"
Cue_E2_6A_CampusA_Insertion_RTC_Warren_120="You're glowing. Seriously. A human halo. I'm pretty sure you earned your wings today."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_140=""Viral" is the right word. Like a disease."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_160="Just one—and a half times..."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_180="Today proves that."
Cue_E2_6A_CampusA_Insertion_RTC_Warren_200="I'm not a big conspiracy guy, but I wouldn't doubt it. Nathan did scare me yesterday and Madsen is a straight-up dickhead. So... what do you think is really happening?"
Cue_E2_6A_CampusA_Insertion_RTC_Warren_220="Feel that temperature drop?"
Cue_E2_6A_CampusA_Insertion_RTC_Warren_240="Do you want my jacket?"
Cue_E2_6A_CampusA_Insertion_RTC_Warren_280="Max, there was no eclipse scheduled today... I would know. I would."
